### Step 1. 필요한 라이브러리 임포트

In [2]:
import pandas as pd

### Step 2. [데이터](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user) 확인

- user_id 유저 아이디
- age 나이
- gender 성별
- occupation 직업
- zip_code 우편번호

### Step 3. 

**read_csv를 통해 데이터를 올바른 형태로 불러온 뒤 users에 저장해주세요.**

user_id를 인덱스로 설정해주세요.

In [4]:
users = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', sep='|')
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

### Step 4. 직업별 평균 연령을 구해주세요

In [5]:
users.groupby('occupation')['age'].mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

### Step 5. 직업별 남성 비율을 구한 뒤 내림차순으로 정렬해주세요

In [6]:
users.columns

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [11]:
users[users['gender']=='M']

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
2          3   23      M         writer    32067
3          4   24      M     technician    43537
5          6   42      M      executive    98101
6          7   57      M  administrator    91344
..       ...  ...    ...            ...      ...
935      936   24      M          other    32789
936      937   48      M       educator    98072
939      940   32      M  administrator    02215
940      941   20      M        student    97229
942      943   22      M        student    77841

[670 rows x 5 columns]

In [32]:
a=users.groupby(['occupation','gender'])[['user_id']].count().unstack()['user_id']
a
a['M_rate(%)']=round(a['M']/(a['F']+a['M'])*100,1)
a

gender            F      M  M_rate(%)
occupation
administrator  36.0   43.0       54.4
artist         13.0   15.0       53.6
doctor          NaN    7.0        NaN
educator       26.0   69.0       72.6
engineer        2.0   65.0       97.0
entertainment   2.0   16.0       88.9
executive       3.0   29.0       90.6
healthcare     11.0    5.0       31.2
homemaker       6.0    1.0       14.3
lawyer          2.0   10.0       83.3
librarian      29.0   22.0       43.1
marketing      10.0   16.0       61.5
none            4.0    5.0       55.6
other          36.0   69.0       65.7
programmer      6.0   60.0       90.9
retired         1.0   13.0       92.9
salesman        3.0    9.0       75.0
scientist       3.0   28.0       90.3
student        60.0  136.0       69.4
technician      1.0   26.0       96.3
writer         19.0   26.0       57.8

In [13]:
users[users['gender']=='M'].groupby('occupation')['gender'].count()

occupation
administrator     43
artist            15
doctor             7
educator          69
engineer          65
entertainment     16
executive         29
healthcare         5
homemaker          1
lawyer            10
librarian         22
marketing         16
none               5
other             69
programmer        60
retired           13
salesman           9
scientist         28
student          136
technician        26
writer            26
Name: gender, dtype: int64

doctor           100.000000
engineer          97.014925
technician        96.296296
retired           92.857143
programmer        90.909091
executive         90.625000
scientist         90.322581
entertainment     88.888889
lawyer            83.333333
salesman          75.000000
educator          72.631579
student           69.387755
other             65.714286
marketing         61.538462
writer            57.777778
none              55.555556
administrator     54.430380
artist            53.571429
librarian         43.137255
healthcare        31.250000
homemaker         14.285714
dtype: float64

### Step 6. 직업별로 나이의 최소값과 최대값을 구해주세요

In [14]:
users.groupby('occupation')['age'].agg(['min','max'])

               min  max
occupation
administrator   21   70
artist          19   48
doctor          28   64
educator        23   63
engineer        22   70
entertainment   15   50
executive       22   69
healthcare      22   62
homemaker       20   50
lawyer          21   53
librarian       23   69
marketing       24   55
none            11   55
other           13   64
programmer      20   63
retired         51   73
salesman        18   66
scientist       23   55
student          7   42
technician      21   55
writer          18   60

               min  max
occupation
administrator   21   70
artist          19   48
doctor          28   64
educator        23   63
engineer        22   70
entertainment   15   50
executive       22   69
healthcare      22   62
homemaker       20   50
lawyer          21   53
librarian       23   69
marketing       24   55
none            11   55
other           13   64
programmer      20   63
retired         51   73
salesman        18   66
scientist       23   55
student          7   42
technician      21   55
writer          18   60

### Step 7. 직업별로 성별을 나눠 평균 연령을 구해주세요

(groupby를 직업과 성별 두 개로 해주시면 됩니다)

In [16]:
users.groupby(['occupation','gender'])['age'].mean()

occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
doctor         M         43.571429
educator       F         39.115385
               M         43.101449
engineer       F         29.500000
               M         36.600000
entertainment  F         31.000000
               M         29.000000
executive      F         44.000000
               M         38.172414
healthcare     F         39.818182
               M         45.400000
homemaker      F         34.166667
               M         23.000000
lawyer         F         39.500000
               M         36.200000
librarian      F         40.000000
               M         40.000000
marketing      F         37.200000
               M         37.875000
none           F         36.500000
               M         18.600000
other          F         35.472222
               M         34.028986
programmer     F         32.166667
               M         33.216667
retired        F         70.000000
               M         62.538462
salesman       F         27.000000
               M         38.555556
scientist      F         28.333333
               M         36.321429
student        F         20.750000
               M         22.669118
technician     F         38.000000
               M         32.961538
writer         F         37.631579
               M         35.346154
Name: age, dtype: float64

occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
doctor         M         43.571429
educator       F         39.115385
               M         43.101449
engineer       F         29.500000
               M         36.600000
entertainment  F         31.000000
               M         29.000000
executive      F         44.000000
               M         38.172414
healthcare     F         39.818182
               M         45.400000
homemaker      F         34.166667
               M         23.000000
lawyer         F         39.500000
               M         36.200000
librarian      F         40.000000
               M         40.000000
marketing      F         37.200000
               M         37.875000
none           F         36.500000
               M         18.600000
other          F         35.472222
               M         34.028986
programmer     F         32.166667
               M         33.216667
retired        F         70.000000
               M         62.538462
salesman       F         27.000000
               M         38.555556
scientist      F         28.333333
               M         36.321429
student        F         20.750000
               M         22.669118
technician     F         38.000000
               M         32.961538
writer         F         37.631579
               M         35.346154
Name: age, dtype: float64

In [ ]:
### Step 8. 직업별로 각 성별이 몇%를 차지하는지 구해주세요

administrator의 경우: 여성비율 45.56%, 남성비율 54.43%

In [37]:
users.groupby(['occupation', 'gender'])[['gender']].count()

                      gender
occupation    gender
administrator F           36
              M           43
artist        F           13
              M           15
doctor        M            7
educator      F           26
              M           69
engineer      F            2
              M           65
entertainment F            2
              M           16
executive     F            3
              M           29
healthcare    F           11
              M            5
homemaker     F            6
              M            1
lawyer        F            2
              M           10
librarian     F           29
              M           22
marketing     F           10
              M           16
none          F            4
              M            5
other         F           36
              M           69
programmer    F            6
              M           60
retired       F            1
              M           13
salesman      F            3
              M            9
scientist     F            3
              M           28
student       F           60
              M          136
technician    F            1
              M           26
writer        F           19
              M           26

In [51]:

# create a data frame and apply count to gender
gender_ocup = users.groupby(['occupation', 'gender']).agg({'gender': 'count'})
occup_count = users.groupby(['occupation'])['gender'].agg('count')

#gender_ocup

In [45]:
gender_ocup.shape

(41, 1)

In [46]:
occup_count.shape

(21,)

In [52]:
occup_count.head()

occupation
administrator    79
artist           28
doctor            7
educator         95
engineer         67
Name: gender, dtype: int64

In [65]:
pd.DataFrame(zip(occup_count,occup_count)).stack().reset_index()

    level_0  level_1    0
0         0        0   79
1         0        1   79
2         1        0   28
3         1        1   28
4         2        0    7
5         2        1    7
6         3        0   95
7         3        1   95
8         4        0   67
9         4        1   67
10        5        0   18
11        5        1   18
12        6        0   32
13        6        1   32
14        7        0   16
15        7        1   16
16        8        0    7
17        8        1    7
18        9        0   12
19        9        1   12
20       10        0   51
21       10        1   51
22       11        0   26
23       11        1   26
24       12        0    9
25       12        1    9
26       13        0  105
27       13        1  105
28       14        0   66
29       14        1   66
30       15        0   14
31       15        1   14
32       16        0   12
33       16        1   12
34       17        0   31
35       17        1   31
36       18        0  196
37       18        1  196
38       19        0   27
39       19        1   27
40       20        0   45
41       20        1   45

In [41]:
gender_ocup.head()

                      gender
occupation    gender
administrator F           36
              M           43
artist        F           13
              M           15
doctor        M            7

In [86]:
a=gender_ocup.unstack('gender')['gender']
a['F_rate']=round(a['F']/(a['F']+a['M'])*100,2)
a['M_rate']=round(a['M']/(a['F']+a['M'])*100,2)
a

gender            F      M  F_rate  M_rate
occupation
administrator  36.0   43.0   45.57   54.43
artist         13.0   15.0   46.43   53.57
doctor          NaN    7.0     NaN     NaN
educator       26.0   69.0   27.37   72.63
engineer        2.0   65.0    2.99   97.01
entertainment   2.0   16.0   11.11   88.89
executive       3.0   29.0    9.38   90.62
healthcare     11.0    5.0   68.75   31.25
homemaker       6.0    1.0   85.71   14.29
lawyer          2.0   10.0   16.67   83.33
librarian      29.0   22.0   56.86   43.14
marketing      10.0   16.0   38.46   61.54
none            4.0    5.0   44.44   55.56
other          36.0   69.0   34.29   65.71
programmer      6.0   60.0    9.09   90.91
retired         1.0   13.0    7.14   92.86
salesman        3.0    9.0   25.00   75.00
scientist       3.0   28.0    9.68   90.32
student        60.0  136.0   30.61   69.39
technician      1.0   26.0    3.70   96.30
writer         19.0   26.0   42.22   57.78

In [70]:
a=gender_ocup.T
a

occupation administrator     artist     doctor educator     engineer      \
gender                 F   M      F   M      M        F   M        F   M
gender                36  43     13  15      7       26  69        2  65

occupation entertainment  ... salesman    scientist     student       \
gender                 F  ...        F  M         F   M       F    M
gender                 2  ...        3  9         3  28      60  136

occupation technician     writer
gender              F   M      F   M
gender              1  26     19  26

[1 rows x 41 columns]

In [75]:
a.columns

MultiIndex([('administrator', 'F'),
            ('administrator', 'M'),
            (       'artist', 'F'),
            (       'artist', 'M'),
            (       'doctor', 'M'),
            (     'educator', 'F'),
            (     'educator', 'M'),
            (     'engineer', 'F'),
            (     'engineer', 'M'),
            ('entertainment', 'F'),
            ('entertainment', 'M'),
            (    'executive', 'F'),
            (    'executive', 'M'),
            (   'healthcare', 'F'),
            (   'healthcare', 'M'),
            (    'homemaker', 'F'),
            (    'homemaker', 'M'),
            (       'lawyer', 'F'),
            (       'lawyer', 'M'),
            (    'librarian', 'F'),
            (    'librarian', 'M'),
            (    'marketing', 'F'),
            (    'marketing', 'M'),
            (         'none', 'F'),
            (         'none', 'M'),
            (        'other', 'F'),
            (        'other', 'M'),
            (   'programmer', 'F'),
            (   'programmer', 'M'),
            (      'retired', 'F'),
            (      'retired', 'M'),
            (     'salesman', 'F'),
            (     'salesman', 'M'),
            (    'scientist', 'F'),
            (    'scientist', 'M'),
            (      'student', 'F'),
            (      'student', 'M'),
            (   'technician', 'F'),
            (   'technician', 'M'),
            (       'writer', 'F'),
            (       'writer', 'M')],
           names=['occupation', 'gender'])

In [72]:
for i in a:
    print(i)
    break

('administrator', 'F')

In [44]:
occup_count.head(3)

occupation
administrator    79
artist           28
doctor            7
Name: gender, dtype: int64